'''
Голодный студент 🌶️

Дима очень хочет поесть, но денег у него мало. Помогите ему определить самый дешевый продукт,
а также магазин, в котором он продается. Вам доступен файл prices.csv, который содержит информацию
о ценах продуктов в различных магазинах. В первом столбце записано название магазина, а в последующих —
цена на соответствующий товар в этом магазине:

Магазин;Творог;Гречка;Рис;Бородинский хлеб;Яблоки;Пельмени;Овсяное печенье;Спагетти;Печеная фасоль;Мороженое;Фарш;Вареники;Картофель;Батончик
Пятерочка;69;133;129;83;141;90;72;123;149;89;88;106;54;84
Магнит;102;87;95;75;109;112;97;82;101;134;69;61;141;79
...

Напишите программу, которая определяет и выводит самый дешевый продукт и название магазина, в котором он продается,
в следующем формате:

<название продукта>: <название магазина>

Если имеется несколько самых дешевых товаров, то следует вывести тот товар, чье название меньше в лексикографическом
сравнении. Если один товар продается в нескольких магазинах по одной минимальной цене, то следует вывести тот магазин,
чье название меньше в лексикографическом сравнении.

Примечание 1. Разделителем в файле prices.csv является точка с запятой, при этом кавычки не используются.

Примечание 2. Указанный файл доступен по ссылке. Ответ на задачу доступен по ссылке.

Примечание 3. Пример вывода:

Клубничный йогурт: ВкусВилл

Примечание 4. При открытии файла используйте явное указание кодировки UTF-8.
'''

import csv

with open('prices.csv', encoding='utf-8', newline='') as file_in:
     rows = list(csv.reader(file_in, delimiter=';'))
columns = rows[0]
data = rows[1:]

# сведение строк в библиотеку {'Творог': [(69, 'Пятерочка'), (102, 'Магнит'), ... , ], 'Батончик': [(84, 'Пятерочка'), (79, 'Магнит')]}

lib = {}
for line in data:
     for i in range(1, len(line)):
          mag = line[0]
          if columns[i] not in lib:
               lib[columns[i]] = [(int(line[i]), mag)]
          else:
               lib[columns[i]].append((int(line[i]), mag))

# сортировка библиотеки lib {'Батончик': [(57, 'Эдельвейс'), (62, 'Авоська')], 'Бородинский хлеб': [(64, 'Лента'), (66, 'Эдельвейс')]

new = {}
for key, value in sorted(lib.items()):
     value = sorted(value, key=lambda x: (int(x[0]), x[1]))
     new[key] = value[:2]

# сортировка библиотеки new [('Вареники', [(50, 'Дикси'), (60, 'МЕТРО')]), ('Пельмени', [(50, 'Аллея'), (52, 'Лента')]),...
new = sorted(new.items(), key=lambda x: x[1][0][0])

print(f'{new[0][0]}: {new[0][1][0][1]}')


'''НАДО ТАК
import csv

with open('prices.csv', encoding='UTF-8') as f:
    h, *rows = csv.reader(f, delimiter=';')

goods = [(r[0], h[x], r[x]) for r in rows for x in range(1, len(h))]
#[('Пятерочка', 'Творог', '69'), ('Пятерочка', 'Гречка', '133'), ('Пятерочка', 'Рис', '129'), ('Пятерочка', 'Бородинский хлеб', '83')
cheapest = min(goods, key=lambda x: (int(x[2]), x[1], x[0]))
#('Дикси', 'Вареники', '50')


print(f'{cheapest[1]}: {cheapest[0]}')
'''