'''Для игры в бинго требуется карточка размером 5×5,
содержащая различные (уникальные) целые числа от 1 до 75 (включительно),
при этом центральная клетка является пустой (она заполняется числом 0).
Напишите программу, которая с помощью модуля random генерирует и выводит случайную карточку для игры в бинго.

Примечание 1. Для наглядности рекомендуем отводить на вывод каждого числа ровно 3 символа.
Для этого используйте строковый метод ljust().
Примечание 2. Пример возможного ответа:

1  16 31 46 61
10 30 42 47 68
3  18 0  48 63
9  19 34 49 70
5  20 35 50 65

Возможны и другие способы генерации карточки для игры в бинго.'''


import random

l = list(range(1, 76))
matrix = []

for i in range(5):
    lj = []
    for j in range(5):
        a = random.choice(l)
        lj.append(a)
        l.remove(a)
    matrix.append(lj)

matrix[2][2] = 0

for i in range(5):
    for j in range(5):
        print(str(matrix[i][j]).ljust(3), end=' ')
    print()
