'''
Я и сам своего рода переводчик

Дана строка соответствия латинскому алфавиту: первый символ строки соответствует букве a,
второй — b, третий — c, и так далее. Каждый символ соответствует как заглавной, так и строчной буквам.
Количество символов в строке совпадает с количеством букв в латинском алфавите.

Напишите программу, которая с помощью данной строки переводит заданный текст.

Формат входных данных
На вход программе в первой строке подается строка соответствия латинскому алфавиту,
в следующей — текст, требующий перевода.

Формат выходных данных
Программа должна с помощью данной строки соответствия латинскому алфавиту перевести введенный
текст и вывести полученный результат.

Примечание 1. Программа должна игнорировать все символы, не являющиеся латинскими буквами.

Примечание 2. Составить словарь соответствия можно с помощью строкового метода maketrans(),
подробнее о котором рассказывается по ссылке.

Примечание 3. Тестовые данные доступны по ссылкам:

    Архив с тестами
    GitHub

Sample Input 1:

🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩
I love Python =)

Sample Output 1:

🅘 🅛🅞🅥🅔 🅟🅨🅣🅗🅞🅝 =)

Sample Input 2:

😀😄😁😆😉😌😍🥰😘😗😙😚😋😛😝😜🤪🤨😫😩🥺😢😭😤😠😡
Dont be so sad!

Sample Output 2:

😆😝😛😩 😄😉 😫😝 😫😀😆!

'''

s = input()
alph = {}

for i in range(65, 91):
    alph[chr(i)] = alph.get(chr(i), s[i - 65])

w = input()
for simb in w:
    if simb.upper() in alph:
        print(alph[simb.upper()], end='')
    else:
        print(simb, end='')