'''Магический шар 8

Описание проекта: магический шар 8 (шар судьбы) — шуточный способ предсказывать будущее.
Программа должна просить пользователя задать некий вопрос, чтобы случайным образом на него ответить.

Составляющие проекта:

    Целые числа (тип int);
    Переменные;
    Ввод / вывод данных (функции input() и print());
    Условный оператор (if/elif/else);
    Цикл while;
    Бесконечный цикл;
    Операторы break, continue;
    Работа с модулем random для генерации случайных чисел.

Варианты ответов

Традиционно шар имеет 20 ответов, которые можно разделить на четыре группы.
Положительные 	Нерешительно положительные 	Нейтральные 	Отрицательные
Бесспорно 	Мне кажется - да 	Пока неясно, попробуй снова 	Даже не думай
Предрешено 	Вероятнее всего 	Спроси позже 	Мой ответ - нет
Никаких сомнений 	Хорошие перспективы 	Лучше не рассказывать 	По моим данным - нет
Определённо да 	Знаки говорят - да 	Сейчас нельзя предсказать 	Перспективы не очень хорошие
Можешь быть уверен в этом 	Да 	Сконцентрируйся и спроси опять 	Весьма сомнительно'''


def fun_answer():
    qw1 = True
    while qw1 == True:
        qw = input()
        print(random.choice(answers), '\n')
        print('Хочешь задать следующий вопрос (да\нет)?', '\n')
        qwes = input().lower()

        if qwes == 'да':
            print('Задай вопрос:', '\n')
        elif qwes == 'нет':
            print('Возвращайся если возникнут вопросы!')
            qw1 = False
        else:
            print('Ответ либо да, либо нет!', '\n')
            qwes = input().lower()
            if qwes == 'да':
                print('Задай вопрос:', '\n')
            elif qwes == 'нет':
                print('Возвращайся если возникнут вопросы!')
                qw1 = False


answers = ['Бесспорно', 'Мне кажется - да', 'Пока неясно, попробуй снова', 'Даже не думай', 'Предрешено',
           'Вероятнее всего', 'Спроси позже', 'Мой ответ - нет', 'Никаких сомнений', 'Хорошие перспективы',
           'Лучше не рассказывать', 'По моим данным - нет', 'Можешь быть уверен в этом', 'Да',
           'Сконцентрируйся и спроси опять', 'Весьма сомнительно']

import random

print('Введите ваше имя', '\n')
print('Привет,', input(), '\n')

print('Задай мне любой вопрос, ответ на который может быть решающим в принятии тобой решения', '\n')

fun_answer()
